from g4f.client import Client

sample_retell = ("Перекажи поданий текст українською мовою своїми словами, зберігаючи зміст і всі згадані назви, "
                 "імена, дати й факти. Використовуй приблизно 500 слів, але не вказуй їхню кількість і не додавай "
                 "жодних додаткових коментарів чи вступних речень. Одразу починай переказ тексту. Не копіюй "
                 "оригінальний текст дослівно—лише коротко та чітко переповідай власними словами.")

sample_translate = ("Напиши український варіант цього тексту, використовуючи інше формулювання, але зберігаючи зміст, "
                    "логіку та всі важливі деталі Обов’язково залиш усі імена, назви, дати, факти та важливі деталі без"
                    "змін. Не додавай вступних слів, привітань, зайвих коментарів чи пояснень. Відразу починай "
                    "переклад.")

label_translate = ("Точно переклади на українську мову цей новинний заголовок. Залиш всі власні імена та назви без "
                   "змін. Не додавай нічого зайвого, крім самого перекладу. Якщо не можеш дослівно через авторське право, "
                   "перекладай своїми словами")

client = Client()


def get_gpt_answer(text, sample):
    content = sample + text
    response = client.chat.completions.create(
        model="gpt-4",
        messages=[{"role": "user", "content": content}],
        web_search=False,
    )
    return response.choices[0].message.content
